{
  "_name_or_path": "answerdotai/ModernBERT-base",
  "architectures": [
    "ModernBertForSequenceClassification"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 50281,
  "classifier_activation": "gelu",
  "classifier_bias": false,
  "classifier_dropout": 0.0,
  "classifier_pooling": "mean",
  "cls_token_id": 50281,
  "decoder_bias": true,
  "deterministic_flash_attn": false,
  "embedding_dropout": 0.0,
  "eos_token_id": 50282,
  "global_attn_every_n_layers": 3,
  "global_rope_theta": 160000.0,
  "gradient_checkpointing": false,
  "hidden_activation": "gelu",
  "hidden_size": 768,
  "id2label": {
    "0": "Acceptance Criteria",
    "1": "Amendment Procedures",
    "2": "Assignment Rights",
    "3": "Audit Rights",
    "4": "Breach of Contract",
    "5": "Change Order Conflicts",
    "6": "Communication Breakdown",
    "7": "Compliance Issues",
    "8": "Confidentiality Breaches",
    "9": "Data Privacy",
    "10": "Delivery Delays",
    "11": "Dispute Resolution Process",
    "12": "Documentation Requirements",
    "13": "Exit Clauses",
    "14": "Force Majeure Claims",
    "15": "Governing Law",
    "16": "Indemnification Issues",
    "17": "Insurance Coverage",
    "18": "Integration Issues",
    "19": "Intellectual Property Rights",
    "20": "Interpretation Disagreements",
    "21": "Jurisdiction Issues",
    "22": "Liability Limits",
    "23": "License Agreement",
    "24": "Maintenance Obligations",
    "25": "Material Changes",
    "26": "Milestone Disputes",
    "27": "Notice Requirements",
    "28": "Payment Default",
    "29": "Payment Schedule",
    "30": "Performance Issues",
    "31": "Performance Metrics",
    "32": "Price Escalation",
    "33": "Quality Control",
    "34": "Quality Standards",
    "35": "Renewal Terms",
    "36": "Reporting Requirements",
    "37": "Resource Allocation",
    "38": "Scope Changes",
    "39": "Security Requirements",
    "40": "Service Level Agreement Violations",
    "41": "Subcontractor Disputes",
    "42": "Support Services",
    "43": "Technical Specifications",
    "44": "Term Extension",
    "45": "Termination Disputes",
    "46": "Testing Requirements",
    "47": "Time Extension Claims",
    "48": "Training Requirements",
    "49": "Warranty Claims"
  },
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 1152,
  "label2id": {
    "Acceptance Criteria": 0,
    "Amendment Procedures": 1,
    "Assignment Rights": 2,
    "Audit Rights": 3,
    "Breach of Contract": 4,
    "Change Order Conflicts": 5,
    "Communication Breakdown": 6,
    "Compliance Issues": 7,
    "Confidentiality Breaches": 8,
    "Data Privacy": 9,
    "Delivery Delays": 10,
    "Dispute Resolution Process": 11,
    "Documentation Requirements": 12,
    "Exit Clauses": 13,
    "Force Majeure Claims": 14,
    "Governing Law": 15,
    "Indemnification Issues": 16,
    "Insurance Coverage": 17,
    "Integration Issues": 18,
    "Intellectual Property Rights": 19,
    "Interpretation Disagreements": 20,
    "Jurisdiction Issues": 21,
    "Liability Limits": 22,
    "License Agreement": 23,
    "Maintenance Obligations": 24,
    "Material Changes": 25,
    "Milestone Disputes": 26,
    "Notice Requirements": 27,
    "Payment Default": 28,
    "Payment Schedule": 29,
    "Performance Issues": 30,
    "Performance Metrics": 31,
    "Price Escalation": 32,
    "Quality Control": 33,
    "Quality Standards": 34,
    "Renewal Terms": 35,
    "Reporting Requirements": 36,
    "Resource Allocation": 37,
    "Scope Changes": 38,
    "Security Requirements": 39,
    "Service Level Agreement Violations": 40,
    "Subcontractor Disputes": 41,
    "Support Services": 42,
    "Technical Specifications": 43,
    "Term Extension": 44,
    "Termination Disputes": 45,
    "Testing Requirements": 46,
    "Time Extension Claims": 47,
    "Training Requirements": 48,
    "Warranty Claims": 49
  },
  "layer_norm_eps": 1e-05,
  "local_attention": 128,
  "local_rope_theta": 10000.0,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "mlp_dropout": 0.0,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "num_attention_heads": 12,
  "num_hidden_layers": 22,
  "pad_token_id": 50283,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "reference_compile": true,
  "repad_logits_with_grad": false,
  "sep_token_id": 50282,
  "sparse_pred_ignore_index": -100,
  "sparse_prediction": false,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "vocab_size": 50368
}
